blog/learning-to-code-first-ocaml-project-episode-2.tutorial.org
#+TITLE: Rewrite in OCaml: Tooling, Association Lists and Pattern Matching
#+DATE: <2020-11-15 Fri>
#+SUBTITLE: Project »CSV Cleaner« – Episodes: [[file:learning-to-code-first-app-episode-1.tutorial.org][1]] | [[file:learning-to-code-first-ocaml-project-episode-2.tutorial.org][2]] | [[file:first-coding-project-ocaml-tail-recursion-episode-3.tutorial.org][3]]
#+LANGUAGE: en
#+DESCRIPTION: A first coding project in OCaml – walktrough tutorial
#+KEYWORDS: ocaml, tutorial, project idea, learn ocaml, walktrough, csv, pattern matching, ocaml scripting
#+HTML_HEAD_EXTRA: <link rel="canonical" href="https://monkeyjunglejuice.github.io/blog/learning-to-code-first-ocaml-project-episode-2.tutorial.html">
#+SETUPFILE: ../static/setup.org
#+OPTIONS: toc:2

* Automate the Boring Stuff with OCaml

This tutorial is the 2nd episode of a little blog series where I extend, refactor and rewrite a small program with each episode. If you haven't read the [[file:learning-to-code-first-app-episode-1.tutorial.org][1st episode using Common Lisp]], you might like to check it out.

I'm on a journey to learn programming, and realized pretty early that I learn stuff best when I prepare myself to explain it to others.

Usually, beginner projects involve programming little games like Ping Pong or Snake or whatever. For me, those kind of projects wouldn't have any other purpose than learning, and I wouldn't play that Ping Pong more than once afterwards.

I find it more likely to stay committed when coding projects have a real world use case. This is why I'm looking for "problems" in my own environment that I would like a computer to solve.

What we're now doing here is manipulating CSV files. I find it tedious to do this by hand using a spreadsheet, so I wanted to automate the task. This little program doesn't do exciting things, but it serves well as a first trivial project.

** From Common Lisp to OCaml

I was using Common Lisp in the [[file:learning-to-code-first-app-episode-1.tutorial.org][previous episode]]. Today I'm going to rewrite everything in OCaml, because I'm still not sure which programming language I like more. I think OCaml is a great programming language for beginners, because:

- There is [[https://cs3110.github.io/textbook/cover.html][excellent learning material]] /(I just finished the [[https://cs3110.github.io/textbook/chapters/basics/exercises.html#][exercises chapter 2.9]])/
- The language has a coherent underlying concept
- Actively developed by a highly engaged community
- The syntax is clutter-free and easy to read
- Source code can be compiled to small binaries
- Multi-purpose and multi-paradigm
- Packed with trend-setting features
- OCaml is fast

I'm not going to compare my experience with *Lisp vs. OCaml* this time, but probably do so in one of the coming episodes.

** OCaml Installation and Project Setup

If you would like to follow the tutorial, you'll need OCaml installed and set up on your machine. I won't go deeply into the setup process here, because it varies depending on the system you use (I use Linux with Emacs). But there's a comprehensive guide: [[https://ocaml.org/learn/tutorials/][Getting started with OCaml]]

*** Checklist

No matter on which platform you are – when your setup is done, you should have at least OCaml's package manager *opam*.

- *VSCode:* Install the packages from the commmand line and the [[https://open-vsx.org/extension/ocamllabs/ocaml-platform][OCaml Platform]] extension
  #+caption: Command line
  #+begin_src shell
    opam install utop ocaml-lsp-server ocamlformat-rpc -y
  #+end_src

- *Emacs:* Install the packages and run /user-setup/
  #+caption: Command line
  #+begin_src shell
    opam install user-setup merlin tuareg -y &&
    opam user-setup install
  #+end_src

- *Vim:* Install the packages and run /user-setup/
  #+caption: Commmand line
  #+begin_src shell
    opam install user-setup utop ocaml-lsp-server -y &&
    opam user-setup install
  #+end_src

*** Project setup

We keep it short:
1. Create a project folder =csvcleaner/= somewhere in your home directory
2. Create an empty file =csvcleaner/csvcleaner.ml= where the source code lives
3. Open the file =csvcleaner/csvcleaner.ml= in your editor of choice

* What the Program should do

Let's define the features first. A checked box means a feature is going to be implemented in this episode:

- [X] Open and read a CSV file =input.csv=
- [X] Remove some columns specified in =template.csv=
- [ ] Perform search and replace on cell content
- [X] Set the pipe '|' as the delimiter char
- [X] Spit out a sweet cleaned CSV file =output.csv=
- [X] Compile to a standalone binary

