blog/learning-to-code-first-ocaml-project-episode-2.tutorial.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2025-12-03 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Rewrite in OCaml: Tooling, Association Lists and Pattern Matching</title>
<meta name="author" content="Dan Dee" />
<meta name="description" content="A first coding project in OCaml – walktrough tutorial" />
<meta name="keywords" content="ocaml, tutorial, project idea, learn ocaml, walktrough, csv, pattern matching, ocaml scripting" />
<meta name="generator" content="Org Mode" />
<meta http-equiv="Content-Security-Policy" content="default-src 'self'; script-src 'self' https://wa.skred.net/; connect-src https://wa.skred.net/; style-src 'self' https://*; font-src 'self' https://*; img-src 'self' https://*; media-src 'self' https://*;">
<link rel="stylesheet" href="/static/normalize.css" type="text/css">
<link rel="stylesheet" href="/static/org.css" type="text/css">
<link rel="stylesheet" href="/static/style.css" type="text/css">
<link rel="preconnect" href="https://fonts.googleapis.com">
<link rel="preconnect" href="https://fonts.gstatic.com" crossorigin>
<link href="https://fonts.googleapis.com/css2?family=Cormorant:wght@300&family=Gentium+Plus:ital,wght@0,400;0,700;1,400;1,700&family=PT+Sans+Caption:wght@400;700&family=PT+Sans+Narrow:wght@400;700&family=PT+Sans:ital,wght@0,400;0,700;1,400;1,700&display=swap" rel="stylesheet">
<link rel="stylesheet" href="/static/fonts/iosevka/fonts.css" type="text/css">
<link rel="icon" type="image/svg+xml" href="/static/monkeyjunglejuice.svg">
<link rel="apple-touch-icon" href="/static/monkeyjunglejuice-icon180.png">
<link rel="canonical" href="https://monkeyjunglejuice.github.io/blog/learning-to-code-first-ocaml-project-episode-2.tutorial.html">
</head>
<body>
<div id="preamble" class="status">
<nav id="nav-primary"><a id="site-name" href="/index.html">MonkeyJungleJuice</a> <a id="index" href="/index.html">Index</a><a id="bio" href="/bio.html">Bio</a><a id="github" href="https://github.com/monkeyjunglejuice">Github</a></nav>
<div class="info"><time itemprop="dateModified" datetime="2025-03-24">Last updated: 2025-03-24</time></div>
</div>
<div id="content" class="content">
<header>
<h1 class="title">Rewrite in OCaml: Tooling, Association Lists and Pattern Matching</h1>
<p class="subtitle" role="doc-subtitle">Project »CSV Cleaner« – 2nd Episode</p>
</header><nav class="pager" id="orgb803a70">
<p>
This post is part of a miniseries:<br>
</p>
<ol class="org-ol">
<li><a href="learning-to-code-first-app-episode-1.tutorial.html">Manipulation CSV Files in Common Lisp</a><br></li>
<li><b><a href="learning-to-code-first-ocaml-project-episode-2.tutorial.html">Rewrite in OCaml &#x2013; Tooling, Association Lists and Pattern Matching</a></b><br></li>
<li><a href="first-coding-project-ocaml-tail-recursion-episode-3.tutorial.html">Eat my Huge Files: Tail Recursion in OCaml</a><br></li>
</ol>
</nav>

<nav id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org21c7ff3">Automate the Boring Stuff with OCaml</a>
<ul>
<li><a href="#org1de7cec">From Common Lisp to OCaml</a></li>
<li><a href="#org786b2e7">OCaml Installation and Project Setup</a></li>
</ul>
</li>
<li><a href="#org9306efb">What the Program should do</a></li>
<li><a href="#org24c9f5d">It&rsquo;s Library Shopping Time!</a></li>
<li><a href="#org9108e4b">How to open a File in OCaml</a>
<ul>
<li><a href="#orgafd1983">Types matter</a></li>
</ul>
</li>
<li><a href="#org35bb383">The CSV Library</a></li>
<li><a href="#orge181c01">Choosing a suitable Data Structure</a></li>
<li><a href="#org5df21f6">How to remove Columns from the CSV</a>
<ul>
<li><a href="#orgad8b992">The Good Ones into the List, the Bad Ones into the Garbage Collector</a></li>
</ul>
</li>
<li><a href="#org52a265e">Save the cleaned CSV to Disk</a></li>
<li><a href="#org5575760">Conclusion</a>
<ul>
<li><a href="#orgcb98e15">Full Code Listing</a></li>
</ul>
</li>
<li><a href="#org1cc37a7">Compile the Standalone Binary Executable</a></li>
<li><a href="#org0be8dff">What&rsquo;s next?</a></li>
</ul>
</div>
</nav>
<div id="outline-container-org21c7ff3" class="outline-2">
<h2 id="org21c7ff3"><a href="#org21c7ff3">Automate the Boring Stuff with OCaml</a></h2>
<div class="outline-text-2" id="text-org21c7ff3">
<p>
This tutorial is the 2nd episode of a little blog series where I extend, refactor and rewrite a small program with each episode. If you haven&rsquo;t read the <a href="learning-to-code-first-app-episode-1.tutorial.html">1st episode using Common Lisp</a>, you might like to check it out.<br>
</p>

<p>
I&rsquo;m on a journey to learn programming, and realized pretty early that I learn stuff best when I prepare myself to explain it to others.<br>
</p>

<p>
Usually, beginner projects involve programming little games like Ping Pong or Snake or whatever. For me, those kind of projects wouldn&rsquo;t have any other purpose than learning, and I wouldn&rsquo;t play that Ping Pong more than once afterwards.<br>
</p>

<p>
I find it more likely to stay committed when coding projects have a real world use case. This is why I&rsquo;m looking for &ldquo;problems&rdquo; in my own environment that I would like a computer to solve.<br>
</p>

<p>
What we&rsquo;re now doing here is manipulating CSV files. I find it tedious to do this by hand using a spreadsheet, so I wanted to automate the task. This little program doesn&rsquo;t do exciting things, but it serves well as a first trivial project.<br>
</p>
</div>
<div id="outline-container-org1de7cec" class="outline-3">
<h3 id="org1de7cec"><a href="#org1de7cec">From Common Lisp to OCaml</a></h3>
<div class="outline-text-3" id="text-org1de7cec">
<p>
I was using Common Lisp in the <a href="learning-to-code-first-app-episode-1.tutorial.html">previous episode</a>. Today I&rsquo;m going to rewrite everything in OCaml, because I&rsquo;m still not sure which programming language I like more. I think OCaml is a great programming language for beginners, because:<br>
</p>

<ul class="org-ul">
<li>There is <a href="https://cs3110.github.io/textbook/cover.html">excellent learning material</a> <i>(I just finished the <a href="https://cs3110.github.io/textbook/chapters/basics/exercises.html#">exercises chapter 2.9</a>)</i><br></li>
<li>The language has a coherent underlying concept<br></li>
<li>Actively developed by a highly engaged community<br></li>
<li>The syntax is clutter-free and easy to read<br></li>
<li>Source code can be compiled to small binaries<br></li>
<li>Multi-purpose and multi-paradigm<br></li>
<li>Packed with trend-setting features<br></li>
<li>OCaml is fast<br></li>
</ul>

<p>
I&rsquo;m not going to compare my experience with <b>Lisp vs. OCaml</b> this time, but probably do so in one of the coming episodes.<br>
</p>
</div>
</div>
<div id="outline-container-org786b2e7" class="outline-3">
<h3 id="org786b2e7"><a href="#org786b2e7">OCaml Installation and Project Setup</a></h3>
<div class="outline-text-3" id="text-org786b2e7">
<p>
If you would like to follow the tutorial, you&rsquo;ll need OCaml installed and set up on your machine. I won&rsquo;t go deeply into the setup process here, because it varies depending on the system you use (I use Linux with Emacs). But there&rsquo;s a comprehensive guide: <a href="https://ocaml.org/learn/tutorials/">Getting started with OCaml</a><br>
</p>
</div>
<div id="outline-container-org388d3fb" class="outline-4">
<h4 id="org388d3fb"><a href="#org388d3fb">Checklist</a></h4>
<div class="outline-text-4" id="text-org388d3fb">
<p>
No matter on which platform you are – when your setup is done, you should have at least OCaml&rsquo;s package manager <b>opam</b>.<br>
</p>

<ul class="org-ul">
<li><p>
<b>VSCode:</b> Install the packages from the commmand line and the <a href="https://open-vsx.org/extension/ocamllabs/ocaml-platform">OCaml Platform</a> extension<br>
</p>
<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 1: </span>Command line</label><pre class="src src-shell">opam install utop ocaml-lsp-server ocamlformat-rpc -y
</pre>
</div></li>

<li><p>
<b>Emacs:</b> Install the packages and run <i>user-setup</i><br>
</p>
<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 2: </span>Command line</label><pre class="src src-shell">opam install user-setup merlin tuareg -y &amp;&amp;
opam user-setup install
</pre>
</div></li>

<li><p>
<b>Vim:</b> Install the packages and run <i>user-setup</i><br>
</p>
<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 3: </span>Commmand line</label><pre class="src src-shell">opam install user-setup utop ocaml-lsp-server -y &amp;&amp;
opam user-setup install
</pre>
</div></li>
</ul>
</div>
</div>
<div id="outline-container-orgdc56cc3" class="outline-4">
<h4 id="orgdc56cc3"><a href="#orgdc56cc3">Project setup</a></h4>
<div class="outline-text-4" id="text-orgdc56cc3">
<p>
We keep it short:<br>
</p>
<ol class="org-ol">
<li>Create a project folder <code>csvcleaner/</code> somewhere in your home directory<br></li>
<li>Create an empty file <code>csvcleaner/csvcleaner.ml</code> where the source code lives<br></li>
<li>Open the file <code>csvcleaner/csvcleaner.ml</code> in your editor of choice<br></li>
</ol>
</div>
</div>
</div>
</div>
<div id="outline-container-org9306efb" class="outline-2">
<h2 id="org9306efb"><a href="#org9306efb">What the Program should do</a></h2>
<div class="outline-text-2" id="text-org9306efb">
<p>
Let&rsquo;s define the features first. A checked box means a feature is going to be implemented in this episode:<br>
</p>

<ul class="org-ul">
<li class="on">&#x2611; Open and read a CSV file <code>input.csv</code><br></li>
<li class="on">&#x2611; Remove some columns specified in <code>template.csv</code><br></li>
<li class="off">&#x2610; Perform search and replace on cell content<br></li>
<li class="on">&#x2611; Set the pipe &rsquo;|&rsquo; as the delimiter char<br></li>
<li class="on">&#x2611; Spit out a sweet cleaned CSV file <code>output.csv</code><br></li>
<li class="on">&#x2611; Compile to a standalone binary<br></li>
</ul>
</div>
</div>
