blog/learning-to-code-first-ocaml-project-episode-2.tutorial.org
* It's Library Shopping Time!

It would be a way larger program if we would code everything from scratch. Let's look around for a library to work with CSV files: https://opam.ocaml.org/packages/. Search for "csv" … Yep! Let's install "Csv" via ~opam install csv~

Now back in the editor we want that library somehow recognized by OCaml, to be able to use it within our own program code. So do we have to load that library (or to use the right words: "load a /module/ from the /package/")? Is there an import statement or something that we have to put into the source file? What happens when we put this into the source file?

#+caption: Example – not part of the program code
#+begin_src ocaml
  open Csv
#+end_src

Turns out the line ~open Csv~ above produces an error "Unbound module Csv" immediately when I save the file, although everything is properly installed and configured. So what's happening here? The error comes from Merlin resp. Ocamllsp who uses Merlin under the hood. Among other things, Merlin checks the source file for errors each time you save it. Merlin should be already installed via opam as a dependency of 'user-setup' or 'ocaml-lsp-server'.

It took me 2 hours to learn Merlin seems to need a file named =.merlin= within the project folder in which the Csv module has to be listed. I've read somewhere else the =csvcleaner/.merlin= file is not neccessary when using Dune, which is the en vogue /build system/ for OCaml.

Back to ~open Csv~. Hm no, that's something slightly different. Once a module is within the search path – which seems to be the case when a +module or library+ package was installed via Opam – then we can refer to a function from that module by "Modulename.functionname" (analogy: Familyname.firstname), e.g. ~Csv.lines~, which is a function that spits out how many lines a CSV has. We need to ~open Csv~ only if we want to omit the function's "family name" and refer to that function by it's "first name" only. I use the full names and don't care about that for now.

We definitely want to use a build system. It makes compiling super easy, avoiding endless command line arguments, messing with module paths and other labourous things. So install Dune via Opam from the command line, if not done yet: ~opam install dune~. Dune requires a configuration file describing the project details, e.g. which libraries to use, and so on. So let's create a file named =csvcleaner/dune= with the following content:

#+caption: File content – csvcleaner/dune
#+begin_src dune
  (executable
   (name csvcleaner)
   (libraries csv))
#+end_src

Pretty self-explaining I guess. There are more stanzas to hold further project information, but these are enough for our little program.

When the file exists, we can issue the command ~dune build~ from the command line to build the (not yet existing) project. The process creates some build artifacts in =csvcleaner/_build=. And for the first time, Merlin recognizes the "Csv" module and shows contained functions via autocompletion in Emacs.

In Emacs (Lisp), you can "execute code" (nah we don't do that! We evaluate expressions!) from within a source file simply by placing the cursor behind an expression and hitting C-x C-e (that means holding down the <CTRL> key and pressing <x> and then <e>). Analogous, in VSCode you can evaluate a selection by holding down <SHIFT> and pressing <ENTER>.

Those keybindings start the OCaml toplevel, either /utop/ or /ocaml/.

In Emacs, the error "Unbound module Csv" appears again, but this time in the toplevel. Turns out, the toplevel doesn't know yet about the module we told Merlin about. The +module+ package has to be loaded in the toplevel separately, using another command ~#require "csv"~. Or better: create a file in the project directory =csvcleaner/.ocamlinit= with the following 2 lines:

#+caption: File content – csvcleaner/.ocamlinit
#+begin_src ocaml
#use "topfind";;
#require "csv";;
#+end_src

That way, the toplevel /ocaml/ or /utop/ will load the +module+ "csv" package at startup. If you use utop, everything should be fine from now on.

If you use Emacs, auto-completion is probably not yet available within the /ocaml/ toplevel. But `M-x merlin-use <RET> csv <RET>' will do the trick. I probably can fix this with a few lines of Emacs Lisp later.

If you use VSCode, I guess everything just works out of the box when the [[https://open-vsx.org/extension/ocamllabs/ocaml-platform][OCaml Platform]] extension is installed and the /language server/ via ~opam install ocaml-lsp-server~. You problably haven't had to learn all those details.

* How to open a File in OCaml

Let's begin with Input/Output. We will try to open and read the CSV file, store its contents in the memory and use a variable to refer to the data, in order to manipulate it later. How do I open a file in OCaml? The [[https://ocaml.org/learn/tutorials/file_manipulation.html][tutorial section]] on the website helps, here is what I found out:

Open files are called /channels/ in OCaml. There's a function ~open_in~ to open a file. This function takes the path of the file as a =string= and returns a type =in_channel=, which seems to be … an abstraction for the open file (?) And there's another function ~close_in~ to close the channel/file again. Let's try!

You can type this in your file =csvcleaner/csvcleaner.ml= and then evaluate those expressions directly ("send to REPL" or something), if your editor allows to do that:
#+caption: Example – not part of the program code
#+begin_src ocaml
  let csv_file' = open_in "input.csv"
  (* <-- Do some stuff here --> *)
  let () = close_in csv_file'
#+end_src

If your editor can't do that, open *utop* in your terminal emulator and type the lines like this. Notice the ~;;~ two semicolons after each expression. You need ~;;~ only in the interactive toplevel, but not in your code:
#+caption: Example – not part of the program code
#+begin_src ocaml
  let csv_file' = open_in "input.csv";;
  (* <-- Do some stuff here --> *)
  let () = close_in csv_file';;
#+end_src

You probably wonder about the ~'~ ASCII apostrophe at the end of some variable- or function names. That basically means "same same but different" – I use ~'~ to mark examples or alternatives that are not part of the program code.

