blog/learning-to-code-first-ocaml-project-episode-2.tutorial.html
<div id="outline-container-org24c9f5d" class="outline-2">
<h2 id="org24c9f5d"><a href="#org24c9f5d">It&rsquo;s Library Shopping Time!</a></h2>
<div class="outline-text-2" id="text-org24c9f5d">
<p>
It would be a way larger program if we would code everything from scratch. Let&rsquo;s look around for a library to work with CSV files: <a href="https://opam.ocaml.org/packages/">https://opam.ocaml.org/packages/</a>. Search for &ldquo;csv&rdquo; … Yep! Let&rsquo;s install &ldquo;Csv&rdquo; via <code>opam install csv</code><br>
</p>

<p>
Now back in the editor we want that library somehow recognized by OCaml, to be able to use it within our own program code. So do we have to load that library (or to use the right words: &ldquo;load a <i>module</i> from the <i>package</i>&rdquo;)? Is there an import statement or something that we have to put into the source file? What happens when we put this into the source file?<br>
</p>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 4: </span>Example – not part of the program code</label><pre class="src src-ocaml">open Csv
</pre>
</div>

<p>
Turns out the line <code>open Csv</code> above produces an error &ldquo;Unbound module Csv&rdquo; immediately when I save the file, although everything is properly installed and configured. So what&rsquo;s happening here? The error comes from Merlin resp. Ocamllsp who uses Merlin under the hood. Among other things, Merlin checks the source file for errors each time you save it. Merlin should be already installed via opam as a dependency of &rsquo;user-setup&rsquo; or &rsquo;ocaml-lsp-server&rsquo;.<br>
</p>

<p>
It took me 2 hours to learn Merlin seems to need a file named <code>.merlin</code> within the project folder in which the Csv module has to be listed. I&rsquo;ve read somewhere else the <code>csvcleaner/.merlin</code> file is not neccessary when using Dune, which is the en vogue <i>build system</i> for OCaml.<br>
</p>

<p>
Back to <code>open Csv</code>. Hm no, that&rsquo;s something slightly different. Once a module is within the search path – which seems to be the case when a <del>module or library</del> package was installed via Opam – then we can refer to a function from that module by &ldquo;Modulename.functionname&rdquo; (analogy: Familyname.firstname), e.g. <code>Csv.lines</code>, which is a function that spits out how many lines a CSV has. We need to <code>open Csv</code> only if we want to omit the function&rsquo;s &ldquo;family name&rdquo; and refer to that function by it&rsquo;s &ldquo;first name&rdquo; only. I use the full names and don&rsquo;t care about that for now.<br>
</p>

<p>
We definitely want to use a build system. It makes compiling super easy, avoiding endless command line arguments, messing with module paths and other labourous things. So install Dune via Opam from the command line, if not done yet: <code>opam install dune</code>. Dune requires a configuration file describing the project details, e.g. which libraries to use, and so on. So let&rsquo;s create a file named <code>csvcleaner/dune</code> with the following content:<br>
</p>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 5: </span>File content – csvcleaner/dune</label><pre class="src src-dune">(executable
 (name csvcleaner)
 (libraries csv))
</pre>
</div>

<p>
Pretty self-explaining I guess. There are more stanzas to hold further project information, but these are enough for our little program.<br>
</p>

<p>
When the file exists, we can issue the command <code>dune build</code> from the command line to build the (not yet existing) project. The process creates some build artifacts in <code>csvcleaner/_build</code>. And for the first time, Merlin recognizes the &ldquo;Csv&rdquo; module and shows contained functions via autocompletion in Emacs.<br>
</p>

<p>
In Emacs (Lisp), you can &ldquo;execute code&rdquo; (nah we don&rsquo;t do that! We evaluate expressions!) from within a source file simply by placing the cursor behind an expression and hitting C-x C-e (that means holding down the &lt;CTRL&gt; key and pressing &lt;x&gt; and then &lt;e&gt;). Analogous, in VSCode you can evaluate a selection by holding down &lt;SHIFT&gt; and pressing &lt;ENTER&gt;.<br>
</p>

<p>
Those keybindings start the OCaml toplevel, either <i>utop</i> or <i>ocaml</i>.<br>
</p>

<p>
In Emacs, the error &ldquo;Unbound module Csv&rdquo; appears again, but this time in the toplevel. Turns out, the toplevel doesn&rsquo;t know yet about the module we told Merlin about. The <del>module</del> package has to be loaded in the toplevel separately, using another command <code>#require "csv"</code>. Or better: create a file in the project directory <code>csvcleaner/.ocamlinit</code> with the following 2 lines:<br>
</p>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 6: </span>File content – csvcleaner/.ocamlinit</label><pre class="src src-ocaml">#use "topfind";;
#require "csv";;
</pre>
</div>

<p>
That way, the toplevel <i>ocaml</i> or <i>utop</i> will load the <del>module</del> &ldquo;csv&rdquo; package at startup. If you use utop, everything should be fine from now on.<br>
</p>

<p>
If you use Emacs, auto-completion is probably not yet available within the <i>ocaml</i> toplevel. But `M-x merlin-use &lt;RET&gt; csv &lt;RET&gt;&rsquo; will do the trick. I probably can fix this with a few lines of Emacs Lisp later.<br>
</p>

<p>
If you use VSCode, I guess everything just works out of the box when the <a href="https://open-vsx.org/extension/ocamllabs/ocaml-platform">OCaml Platform</a> extension is installed and the <i>language server</i> via <code>opam install ocaml-lsp-server</code>. You problably haven&rsquo;t had to learn all those details.<br>
</p>
</div>
</div>
<div id="outline-container-org9108e4b" class="outline-2">
<h2 id="org9108e4b"><a href="#org9108e4b">How to open a File in OCaml</a></h2>
<div class="outline-text-2" id="text-org9108e4b">
<p>
Let&rsquo;s begin with Input/Output. We will try to open and read the CSV file, store its contents in the memory and use a variable to refer to the data, in order to manipulate it later. How do I open a file in OCaml? The <a href="https://ocaml.org/learn/tutorials/file_manipulation.html">tutorial section</a> on the website helps, here is what I found out:<br>
</p>

<p>
Open files are called <i>channels</i> in OCaml. There&rsquo;s a function <code>open_in</code> to open a file. This function takes the path of the file as a <code>string</code> and returns a type <code>in_channel</code>, which seems to be … an abstraction for the open file (?) And there&rsquo;s another function <code>close_in</code> to close the channel/file again. Let&rsquo;s try!<br>
</p>

<p>
You can type this in your file <code>csvcleaner/csvcleaner.ml</code> and then evaluate those expressions directly (&ldquo;send to REPL&rdquo; or something), if your editor allows to do that:<br>
</p>
<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 7: </span>Example – not part of the program code</label><pre class="src src-ocaml">let csv_file' = open_in "input.csv"
(* &lt;-- Do some stuff here --&gt; *)
let () = close_in csv_file'
</pre>
</div>

<p>
If your editor can&rsquo;t do that, open <b>utop</b> in your terminal emulator and type the lines like this. Notice the <code>;;</code> two semicolons after each expression. You need <code>;;</code> only in the interactive toplevel, but not in your code:<br>
</p>
<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 8: </span>Example – not part of the program code</label><pre class="src src-ocaml">let csv_file' = open_in "input.csv";;
(* &lt;-- Do some stuff here --&gt; *)
let () = close_in csv_file';;
</pre>
</div>

<p>
You probably wonder about the <code>'</code> ASCII apostrophe at the end of some variable- or function names. That basically means &ldquo;same same but different&rdquo; – I use <code>'</code> to mark examples or alternatives that are not part of the program code.<br>
</p>
</div>
