blog/learning-to-code-first-ocaml-project-episode-2.tutorial.org
** Types matter

The value bound to the variable ~csv_file'~ has the /type/ ~in_channel~. So now we need another function that can do something with a piece of data with the type ~in_channel~. Types matter a lot in OCaml, you will see that later.

The ~in_channel~ is something that enables us to read a file and points to the beginnning of the file. Still it seems we are pretty far from having the content of the CSV file available as a /data structure/ that we can manipulate at will. Maybe it's time to let the ~Csv~ module take over? Nah, not so fast. Let's poke a little bit on that channel thing. I'm curious how it behaves and what I can get out of it.

Cool, I found out there are a couple functions that begin with "input_" and they all can operate on the type ~in_channel~! Most of them are "built-in"; that means they are members of the module "Stdlib" which is always loaded by default. I've stumbled upon the available functions via auto-completion – it's one of the most life changing inventions of humankind and comes right after the dishwasher, which is of course the greatest of all accomplishments of all time.

Let's write a couple of functions to get stuff out of that channel. So there's ~input_line~: That one reads one line from the file and makes a string out of it. The next time we apply that function, it outputs the next line and so on, until the whole channel is "consumed". So that's probably not a /pure/ function (those always return the same output with the same input)?

#+caption: Example – not part of the program code
#+begin_src ocaml
  let csv_file' = open_in "input.csv"
  let () = print_endline (input_line csv_file')
  let () = close_in csv_file'
#+end_src

And here's another function ~input_char~ in the Stdlib that returns the content of the stream character-wise. But we cannot print it to the screen via ~print_endline~, because that particular print function can only print data of the type ~string~. But ~input_char~ returns data from the type ~char~, so we either need to convert the chars into strings, or we have to use another function that prints chars directly. Same here: it spits out one char after another, until the channel is "consumed":

#+caption: Example – not part of the program code
#+begin_src ocaml
  let csv_file' = open_in "input.csv"
  let () = print_char (input_char csv_file')
  let () = close_in csv_file'
#+end_src

* The CSV Library

The auto-completion suggests another function ~Csv.input_all~ which is part of the ~Csv~ module. Instead of building up a data structure from single lines, perhaps we can get a bit more convenience using more of the ~Csv~ module functionality from here on? Let's try it.

But I cannot apply ~Csv.input_all~ to ~csv_file'~ which is of type ~in_channel~, because it expects its arguments to be of the type ~Csv.in_channel~, not ~in_channel~. I'm confused.

#+caption: Example – not part of the program code
#+begin_src ocaml
  let csv_file' = open_in "input.csv"
  let () = print_endline (Csv.input_all csv_file') (* ← Nah, not working! Wrong type! *)
  let () = close_in csv_file'
#+end_src

Why is ~csv_file'~ of type ~in_channel~? Because ~open_in~ is. Does it mean we'll better not use the function ~open_in~ to open the file but something else?

Nope, I think I have found something: the function ~Csv.of_channel~. It can transform the ~csv_file'~ into something we can manipulate conveniently … well, hold on.

We will now transform the data from ~csv_file~ in 3 steps into a data structure we can manipulate.
1. We apply the function ~Csv.of_channel~ from the Csv library on the ~csv_file~ to set the reading parameters and eventually read the data from the ~csv_file~.
2. Now we apply the function ~Csv.input_all~ on the returned value from the function ~Csv.of_channel~ to construct a nested list from the content of the CSV file, where each row becomes a list of strings.
3. We bind a variable to that nested list, so we can refer to it later.

#+caption:
#+begin_src ocaml
  let csv_file = open_in "input.csv"

  let table =          (* 3. Variable bound to the list of lists *)
    Csv.input_all      (* 2. That function makes a list of lists from the CSV content *)
      (Csv.of_channel  (* 1. This function reads what's found in the [csv_file] *)
         csv_file)     (*    The "normal" [in_channel] passed as an argument *)

  let () = close_in csv_file  (* We have all we need, let's close that file *)
#+end_src

So far the nested list we created in the 3 steps above looks like below. In that list, the column headers "a", "b", "c" and "d" convey no special meaning; even tough they sit in the first row, they are nothing more than just a list of strings like all the other rows.

#+caption: Result – not part of the program code
#+begin_src ocaml
  val table : Csv.t =
              [["a"; "b"; "c"; "d"];
               ["1"; "2"; "3"; "4"];
               ["5"; "6"; "7"; "8"];
               ["9"; "10"; "11"; "12"]]
#+end_src

