blog/learning-to-code-first-ocaml-project-episode-2.tutorial.html
<div id="outline-container-orgafd1983" class="outline-3">
<h3 id="orgafd1983"><a href="#orgafd1983">Types matter</a></h3>
<div class="outline-text-3" id="text-orgafd1983">
<p>
The value bound to the variable <code>csv_file'</code> has the <i>type</i> <code>in_channel</code>. So now we need another function that can do something with a piece of data with the type <code>in_channel</code>. Types matter a lot in OCaml, you will see that later.<br>
</p>

<p>
The <code>in_channel</code> is something that enables us to read a file and points to the beginnning of the file. Still it seems we are pretty far from having the content of the CSV file available as a <i>data structure</i> that we can manipulate at will. Maybe it&rsquo;s time to let the <code>Csv</code> module take over? Nah, not so fast. Let&rsquo;s poke a little bit on that channel thing. I&rsquo;m curious how it behaves and what I can get out of it.<br>
</p>

<p>
Cool, I found out there are a couple functions that begin with &ldquo;input_&rdquo; and they all can operate on the type <code>in_channel</code>! Most of them are &ldquo;built-in&rdquo;; that means they are members of the module &ldquo;Stdlib&rdquo; which is always loaded by default. I&rsquo;ve stumbled upon the available functions via auto-completion – it&rsquo;s one of the most life changing inventions of humankind and comes right after the dishwasher, which is of course the greatest of all accomplishments of all time.<br>
</p>

<p>
Let&rsquo;s write a couple of functions to get stuff out of that channel. So there&rsquo;s <code>input_line</code>: That one reads one line from the file and makes a string out of it. The next time we apply that function, it outputs the next line and so on, until the whole channel is &ldquo;consumed&rdquo;. So that&rsquo;s probably not a <i>pure</i> function (those always return the same output with the same input)?<br>
</p>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 9: </span>Example – not part of the program code</label><pre class="src src-ocaml">let csv_file' = open_in "input.csv"
let () = print_endline (input_line csv_file')
let () = close_in csv_file'
</pre>
</div>

<p>
And here&rsquo;s another function <code>input_char</code> in the Stdlib that returns the content of the stream character-wise. But we cannot print it to the screen via <code>print_endline</code>, because that particular print function can only print data of the type <code>string</code>. But <code>input_char</code> returns data from the type <code>char</code>, so we either need to convert the chars into strings, or we have to use another function that prints chars directly. Same here: it spits out one char after another, until the channel is &ldquo;consumed&rdquo;:<br>
</p>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 10: </span>Example – not part of the program code</label><pre class="src src-ocaml">let csv_file' = open_in "input.csv"
let () = print_char (input_char csv_file')
let () = close_in csv_file'
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org35bb383" class="outline-2">
<h2 id="org35bb383"><a href="#org35bb383">The CSV Library</a></h2>
<div class="outline-text-2" id="text-org35bb383">
<p>
The auto-completion suggests another function <code>Csv.input_all</code> which is part of the <code>Csv</code> module. Instead of building up a data structure from single lines, perhaps we can get a bit more convenience using more of the <code>Csv</code> module functionality from here on? Let&rsquo;s try it.<br>
</p>

<p>
But I cannot apply <code>Csv.input_all</code> to <code>csv_file'</code> which is of type <code>in_channel</code>, because it expects its arguments to be of the type <code>Csv.in_channel</code>, not <code>in_channel</code>. I&rsquo;m confused.<br>
</p>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 11: </span>Example – not part of the program code</label><pre class="src src-ocaml">let csv_file' = open_in "input.csv"
let () = print_endline (Csv.input_all csv_file') (* ← Nah, not working! Wrong type! *)
let () = close_in csv_file'
</pre>
</div>

<p>
Why is <code>csv_file'</code> of type <code>in_channel</code>? Because <code>open_in</code> is. Does it mean we&rsquo;ll better not use the function <code>open_in</code> to open the file but something else?<br>
</p>

<p>
Nope, I think I have found something: the function <code>Csv.of_channel</code>. It can transform the <code>csv_file'</code> into something we can manipulate conveniently … well, hold on.<br>
</p>

<p>
We will now transform the data from <code>csv_file</code> in 3 steps into a data structure we can manipulate.<br>
</p>
<ol class="org-ol">
<li>We apply the function <code>Csv.of_channel</code> from the Csv library on the <code>csv_file</code> to set the reading parameters and eventually read the data from the <code>csv_file</code>.<br></li>
<li>Now we apply the function <code>Csv.input_all</code> on the returned value from the function <code>Csv.of_channel</code> to construct a nested list from the content of the CSV file, where each row becomes a list of strings.<br></li>
<li>We bind a variable to that nested list, so we can refer to it later.<br></li>
</ol>

<div class="org-src-container">
<pre class="src src-ocaml">let csv_file = open_in "input.csv"

let table =          (* 3. Variable bound to the list of lists *)
  Csv.input_all      (* 2. That function makes a list of lists from the CSV content *)
    (Csv.of_channel  (* 1. This function reads what's found in the [csv_file] *)
       csv_file)     (*    The "normal" [in_channel] passed as an argument *)

let () = close_in csv_file  (* We have all we need, let's close that file *)
</pre>
</div>

<p>
So far the nested list we created in the 3 steps above looks like below. In that list, the column headers &ldquo;a&rdquo;, &ldquo;b&rdquo;, &ldquo;c&rdquo; and &ldquo;d&rdquo; convey no special meaning; even tough they sit in the first row, they are nothing more than just a list of strings like all the other rows.<br>
</p>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 13: </span>Result – not part of the program code</label><pre class="src src-ocaml">val table : Csv.t =
            [["a"; "b"; "c"; "d"];
             ["1"; "2"; "3"; "4"];
             ["5"; "6"; "7"; "8"];
             ["9"; "10"; "11"; "12"]]
</pre>
</div>
</div>
</div>
