blog/learning-to-code-first-ocaml-project-episode-2.tutorial.org
* Choosing a suitable Data Structure

#+begin_quote
"It is better to have 100 functions operate on one data structure than to have 10 functions operate on 10 data structures."
@@html:<cite>@@—Alan Perlis@@html:</cite>@@
#+end_quote

[[file:learning-to-code-first-app-episode-1.tutorial.org][In the previous episode]] I was just using a simple /list of lists/ like above as my primary data structure; and then I removed the columns (cells) from each row by their position. This is a bit awkward to work with but ok, because I treated the data like it was immutable. This time we go one step further.

In order to conveniently manipulate the data, we want to associate /meaning/ (column headers) with the /content/ (table cells). To connect each column header with the cells who belong to the same column, we can transform the table above into another data structure that will allow such association: enter the /association list/ a.k.a. /map/ or /dictionary/.

In OCaml, an association list is usually implemented as a list containing /tuples/. The first element in the tuple ~"a"~ is the "key", and the second element ~"1"~ is the "value". The parens around tuples can be omitted. So that means if you encounter two or more things in OCaml code separated by a comma, it's actually a tuple – parens or not:

#+caption: Example – not part of the program code
#+begin_src ocaml
  let example_alist' = [("a", "1"); ("b", "2"); ("c", "3"); ("d", "4")]
  let example_alist'' = ["a", "1"; "b", "2"; "c", "3"; "d", "4"]
#+end_src

The Csv module provides a convenient function ~Csv.associate~ that transforms the ~table~ into such an association list, but it expects the data for its arguments to be of a certain type. And here's the type signature of the function ~Csv.associate~. It says what type of arguments the function wants and of what the return value will be:

#+caption: Example – not part of the program code
#+begin_src ocaml
  string list -> string list list -> (string * string) list list
#+end_src

- The 1st argument must be a string list ->
- The 2nd argument must be a string list, wrapped in another list ->
- Returns what: two-string tuples, wrapped in lists, wrapped in another list

Let's find a way to provide the arguments exactly like that. If we don't, we'll get a type error. The first argument will deliver the column headers to the function, and the second argument will deliver the other rows (lists) containing the single cells (strings).

We split that ~table~ into the "head" /(that's a common concept and means the first element of a list)/ and refer to it with the variable ~header~.

Then we take the "tail" of the list /(also a common term in programming which means the rest of a list, which is itself a list of the remaining elements of the original list)/ and refer to it with the variable ~content~:

The expression below deserves some explanation. What we see there, is /pattern matching/, a technique available in some programming languages from the "functional" corner, eg. Haskell, Erlang, Elixir or Common Lisp. Other mainstream languages might get it bolted on in the future.

What it does: Pattern matching is a form of conditional branching which allows you to match on data structure patterns and bind variables /at the same time/. It helps to produce clean, concise code. For example, we can avoid those clumsy nested if-then-else-if constructs. I'm a huge fan of pattern matching and it's everywhere in OCaml.

#+caption: Multiple assignment via pattern matching
#+begin_src ocaml
  let header, content =
    match table with
    | [] -> assert false
    | hd :: tl -> hd, tl
#+end_src

In the definition above, we take the ~table~ which is essentially a /list/ data structure with other lists in it. A list can be divided into sub-structures, the "head" and "tail"; in Lisp called "car" and "cdr", or sometimes "first" and "rest".

On the left side of the branch (left of the arrow) we write down the pattern and assign variables to the sub-structures we want to use later (in that case ~hd~ for "head" and ~tl~ for "tail") -> On the right side of the branch, we write down what to do with those variables. In our case here, the right side says "construct a tuple from ~hd~ and ~tl~" which is concisely expressed as ~hd, tl~, or ~(hd, tl)~.

Note that it doesn't matter how we name those variables – they don't have to be named ~hd~ and ~tl~ – they could as well be ~brain~ and ~pinky~. The crucial detail is the cons operator ~::~ who does only one thing: construct a list from an empty list ~[]~ and one or more elements: ~"a" :: "b" :: "c" :: "d" :: []~ You recognize the pattern here?

If the ~table~ is not an empty list, then the expression will return the tuple ~hd, tl~ containing the head and the tail of the ~table~. What it does then, is [[https://ocamlbook.org/algebraic-types/#pattern-matching][multiple assignment by another act of pattern matching]]: The the returned tuple ~hd, tl~ is matched against the pattern ~header~, ~content~ so that the value from ~hd~ is assigned to ~header~ and from ~tl~ to ~content~.

When we evaluate the expression above, we finally get the following values, and they have the desired types expected by the function ~Csv.associate~:

#+caption: Results – not part of the program code
#+begin_src ocaml
  val header : string list = ["a"; "b"; "c"; "d"]

  val content : string list list =
                [["1"; "2"; "3"; "4"];
                 ["5"; "6"; "7"; "8"];
                 ["9"; "10"; "11"; "12"]]
#+end_src

Eventually we can apply the function ~Csv.assocciate~ to combine each column header element with the content cells who belong to it:

#+caption: Function application
#+begin_src ocaml
let table_assoc = Csv.associate header content
#+end_src

That's how our table looks like after the transformation – the column headers "a", "b", "c", and "d" have been associated with the corresponding table cells:

#+caption: Result – not part of the program code
#+begin_src ocaml
  val table_assoc : (string * string) list list =
                    [[("a", "1"); ("b", "2"); ("c", "3"); ("d", "4")];
                     [("a", "5"); ("b", "6"); ("c", "7"); ("d", "8")];
                     [("a", "9"); ("b", "10"); ("c", "11"); ("d", "12")]]
#+end_src

