blog/learning-to-code-first-ocaml-project-episode-2.tutorial.html
<div id="outline-container-orge181c01" class="outline-2">
<h2 id="orge181c01"><a href="#orge181c01">Choosing a suitable Data Structure</a></h2>
<div class="outline-text-2" id="text-orge181c01">
<blockquote>
<p>
&ldquo;It is better to have 100 functions operate on one data structure than to have 10 functions operate on 10 data structures.&rdquo;<br>
<cite>—Alan Perlis</cite><br>
</p>
</blockquote>

<p>
<a href="learning-to-code-first-app-episode-1.tutorial.html">In the previous episode</a> I was just using a simple <i>list of lists</i> like above as my primary data structure; and then I removed the columns (cells) from each row by their position. This is a bit awkward to work with but ok, because I treated the data like it was immutable. This time we go one step further.<br>
</p>

<p>
In order to conveniently manipulate the data, we want to associate <i>meaning</i> (column headers) with the <i>content</i> (table cells). To connect each column header with the cells who belong to the same column, we can transform the table above into another data structure that will allow such association: enter the <i>association list</i> a.k.a. <i>map</i> or <i>dictionary</i>.<br>
</p>

<p>
In OCaml, an association list is usually implemented as a list containing <i>tuples</i>. The first element in the tuple <code>"a"</code> is the &ldquo;key&rdquo;, and the second element <code>"1"</code> is the &ldquo;value&rdquo;. The parens around tuples can be omitted. So that means if you encounter two or more things in OCaml code separated by a comma, it&rsquo;s actually a tuple – parens or not:<br>
</p>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 14: </span>Example – not part of the program code</label><pre class="src src-ocaml">let example_alist' = [("a", "1"); ("b", "2"); ("c", "3"); ("d", "4")]
let example_alist'' = ["a", "1"; "b", "2"; "c", "3"; "d", "4"]
</pre>
</div>

<p>
The Csv module provides a convenient function <code>Csv.associate</code> that transforms the <code>table</code> into such an association list, but it expects the data for its arguments to be of a certain type. And here&rsquo;s the type signature of the function <code>Csv.associate</code>. It says what type of arguments the function wants and of what the return value will be:<br>
</p>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 15: </span>Example – not part of the program code</label><pre class="src src-ocaml">string list -&gt; string list list -&gt; (string * string) list list
</pre>
</div>

<ul class="org-ul">
<li>The 1st argument must be a string list -&gt;<br></li>
<li>The 2nd argument must be a string list, wrapped in another list -&gt;<br></li>
<li>Returns what: two-string tuples, wrapped in lists, wrapped in another list<br></li>
</ul>

<p>
Let&rsquo;s find a way to provide the arguments exactly like that. If we don&rsquo;t, we&rsquo;ll get a type error. The first argument will deliver the column headers to the function, and the second argument will deliver the other rows (lists) containing the single cells (strings).<br>
</p>

<p>
We split that <code>table</code> into the &ldquo;head&rdquo; <i>(that&rsquo;s a common concept and means the first element of a list)</i> and refer to it with the variable <code>header</code>.<br>
</p>

<p>
Then we take the &ldquo;tail&rdquo; of the list <i>(also a common term in programming which means the rest of a list, which is itself a list of the remaining elements of the original list)</i> and refer to it with the variable <code>content</code>:<br>
</p>

<p>
The expression below deserves some explanation. What we see there, is <i>pattern matching</i>, a technique available in some programming languages from the &ldquo;functional&rdquo; corner, eg. Haskell, Erlang, Elixir or Common Lisp. Other mainstream languages might get it bolted on in the future.<br>
</p>

<p>
What it does: Pattern matching is a form of conditional branching which allows you to match on data structure patterns and bind variables <i>at the same time</i>. It helps to produce clean, concise code. For example, we can avoid those clumsy nested if-then-else-if constructs. I&rsquo;m a huge fan of pattern matching and it&rsquo;s everywhere in OCaml.<br>
</p>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 16: </span>Multiple assignment via pattern matching</label><pre class="src src-ocaml">let header, content =
  match table with
  | [] -&gt; assert false
  | hd :: tl -&gt; hd, tl
</pre>
</div>

<p>
In the definition above, we take the <code>table</code> which is essentially a <i>list</i> data structure with other lists in it. A list can be divided into sub-structures, the &ldquo;head&rdquo; and &ldquo;tail&rdquo;; in Lisp called &ldquo;car&rdquo; and &ldquo;cdr&rdquo;, or sometimes &ldquo;first&rdquo; and &ldquo;rest&rdquo;.<br>
</p>

<p>
On the left side of the branch (left of the arrow) we write down the pattern and assign variables to the sub-structures we want to use later (in that case <code>hd</code> for &ldquo;head&rdquo; and <code>tl</code> for &ldquo;tail&rdquo;) -&gt; On the right side of the branch, we write down what to do with those variables. In our case here, the right side says &ldquo;construct a tuple from <code>hd</code> and <code>tl</code>&rdquo; which is concisely expressed as <code>hd, tl</code>, or <code>(hd, tl)</code>.<br>
</p>

<p>
Note that it doesn&rsquo;t matter how we name those variables – they don&rsquo;t have to be named <code>hd</code> and <code>tl</code> – they could as well be <code>brain</code> and <code>pinky</code>. The crucial detail is the cons operator <code>::</code> who does only one thing: construct a list from an empty list <code>[]</code> and one or more elements: <code>"a" :: "b" :: "c" :: "d" :: []</code> You recognize the pattern here?<br>
</p>

<p>
If the <code>table</code> is not an empty list, then the expression will return the tuple <code>hd, tl</code> containing the head and the tail of the <code>table</code>. What it does then, is <a href="https://ocamlbook.org/algebraic-types/#pattern-matching">multiple assignment by another act of pattern matching</a>: The the returned tuple <code>hd, tl</code> is matched against the pattern <code>header</code>, <code>content</code> so that the value from <code>hd</code> is assigned to <code>header</code> and from <code>tl</code> to <code>content</code>.<br>
</p>

<p>
When we evaluate the expression above, we finally get the following values, and they have the desired types expected by the function <code>Csv.associate</code>:<br>
</p>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 17: </span>Results – not part of the program code</label><pre class="src src-ocaml">val header : string list = ["a"; "b"; "c"; "d"]

val content : string list list =
              [["1"; "2"; "3"; "4"];
               ["5"; "6"; "7"; "8"];
               ["9"; "10"; "11"; "12"]]
</pre>
</div>

<p>
Eventually we can apply the function <code>Csv.assocciate</code> to combine each column header element with the content cells who belong to it:<br>
</p>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 18: </span>Function application</label><pre class="src src-ocaml">let table_assoc = Csv.associate header content
</pre>
</div>

<p>
That&rsquo;s how our table looks like after the transformation – the column headers &ldquo;a&rdquo;, &ldquo;b&rdquo;, &ldquo;c&rdquo;, and &ldquo;d&rdquo; have been associated with the corresponding table cells:<br>
</p>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 19: </span>Result – not part of the program code</label><pre class="src src-ocaml">val table_assoc : (string * string) list list =
                  [[("a", "1"); ("b", "2"); ("c", "3"); ("d", "4")];
                   [("a", "5"); ("b", "6"); ("c", "7"); ("d", "8")];
                   [("a", "9"); ("b", "10"); ("c", "11"); ("d", "12")]]
</pre>
</div>
</div>
</div>
