blog/learning-to-code-first-ocaml-project-episode-2.tutorial.org
* How to remove Columns from the CSV

We will use another CSV that is going to serve as a template to specify which columns to keep. We can use almost the same construct like before where we read the file ~input.csv~. But since we need only the first row of the ~template.csv~, we'll make sure to get only that.

#+caption: Creating the template
#+begin_src ocaml
  let template_file = open_in "template.csv"

  let template =
    Csv.Rows.header
      (Csv.of_channel ~has_header:true
         template_file)

  let () = close_in template_file
#+end_src

So far we have read, transformed and stored the template in memory, bound it to a variable and closed the file.

Small detail on the side: in OCaml we can write /function application/ like so – pipe a value trough some functions – using the "pipe operator":

#+caption: Alternative – not part of the program code
#+begin_src ocaml
  let template' = template_file
                  |> Csv.of_channel ~has_header:true
                  |> Csv.Rows.header
#+end_src

And here's the return value:

#+caption: Result – not part of the program code
#+begin_src ocaml
  val template' : string list = ["b"; "d"]
#+end_src

** The Good Ones into the List, the Bad Ones into the Garbage Collector

"Removing columns" is actually misleading: Technically, the function does not remove or delete anything, because … its impossible! Lists in OCaml are immutable – they cannot be changed. So what we will do instead: construct a new list from the columns we want to keep, according to the column headers specified by the template. And simply forget about the others.

#+caption: Recursive function using pattern matching on a list of tuples
#+begin_src ocaml
  let rec remove_columns tpl row =
    match row with
    | [] -> []
    | (k, v) :: tl when List.mem k tpl -> (k, v) :: remove_columns tpl tl
    | _ :: tl -> remove_columns tpl tl
#+end_src

Let's see if the function works on a single row, which is represented by an association list, implemented as a list of tuples ~(string * string) list~ (spoiler: it works!)

Here's the example of one single row from the ~table_assoc~:

#+caption: Example – not part of the program code
#+begin_src ocaml
  let single_row' = [("a", "1"); ("b", "2"); ("c", "3"); ("d", "4")]
  let cleaned_row' = remove_columns template single_row'
#+end_src

Lets apply this function to all rows of the ~table_assoc~, wich is a list of lists of tuples ~(string * string) list list~. The function ~remove_columns~ takes two arguments, but since [[http://xahlee.info/UnixResource_dir/writ/currying.html][functions in OCaml are curried by default]], they take in fact only one argument, but return a function who takes the second argument, and so on. That's also called /partial function application/. So we can apply ~remove_columns~ to the argument ~template~ and map the resulting partial function onto each element of the ~table_assoc~

#+caption: Mapping a partial function onto a list of association lists
#+begin_src ocaml
  let table_cleaned = List.map (remove_columns template) table_assoc
#+end_src

