blog/learning-to-code-first-ocaml-project-episode-2.tutorial.html
<div id="outline-container-org5df21f6" class="outline-2">
<h2 id="org5df21f6"><a href="#org5df21f6">How to remove Columns from the CSV</a></h2>
<div class="outline-text-2" id="text-org5df21f6">
<p>
We will use another CSV that is going to serve as a template to specify which columns to keep. We can use almost the same construct like before where we read the file <code>input.csv</code>. But since we need only the first row of the <code>template.csv</code>, we&rsquo;ll make sure to get only that.<br>
</p>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 20: </span>Creating the template</label><pre class="src src-ocaml">let template_file = open_in "template.csv"

let template =
  Csv.Rows.header
    (Csv.of_channel ~has_header:true
       template_file)

let () = close_in template_file
</pre>
</div>

<p>
So far we have read, transformed and stored the template in memory, bound it to a variable and closed the file.<br>
</p>

<p>
Small detail on the side: in OCaml we can write <i>function application</i> like so – pipe a value trough some functions – using the &ldquo;pipe operator&rdquo;:<br>
</p>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 21: </span>Alternative – not part of the program code</label><pre class="src src-ocaml">let template' = template_file
                |&gt; Csv.of_channel ~has_header:true
                |&gt; Csv.Rows.header
</pre>
</div>

<p>
And here&rsquo;s the return value:<br>
</p>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 22: </span>Result – not part of the program code</label><pre class="src src-ocaml">val template' : string list = ["b"; "d"]
</pre>
</div>
</div>
<div id="outline-container-orgad8b992" class="outline-3">
<h3 id="orgad8b992"><a href="#orgad8b992">The Good Ones into the List, the Bad Ones into the Garbage Collector</a></h3>
<div class="outline-text-3" id="text-orgad8b992">
<p>
&ldquo;Removing columns&rdquo; is actually misleading: Technically, the function does not remove or delete anything, because … its impossible! Lists in OCaml are immutable – they cannot be changed. So what we will do instead: construct a new list from the columns we want to keep, according to the column headers specified by the template. And simply forget about the others.<br>
</p>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 23: </span>Recursive function using pattern matching on a list of tuples</label><pre class="src src-ocaml">let rec remove_columns tpl row =
  match row with
  | [] -&gt; []
  | (k, v) :: tl when List.mem k tpl -&gt; (k, v) :: remove_columns tpl tl
  | _ :: tl -&gt; remove_columns tpl tl
</pre>
</div>

<p>
Let&rsquo;s see if the function works on a single row, which is represented by an association list, implemented as a list of tuples <code>(string * string) list</code> (spoiler: it works!)<br>
</p>

<p>
Here&rsquo;s the example of one single row from the <code>table_assoc</code>:<br>
</p>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 24: </span>Example – not part of the program code</label><pre class="src src-ocaml">let single_row' = [("a", "1"); ("b", "2"); ("c", "3"); ("d", "4")]
let cleaned_row' = remove_columns template single_row'
</pre>
</div>

<p>
Lets apply this function to all rows of the <code>table_assoc</code>, wich is a list of lists of tuples <code>(string * string) list list</code>. The function <code>remove_columns</code> takes two arguments, but since <a href="http://xahlee.info/UnixResource_dir/writ/currying.html">functions in OCaml are curried by default</a>, they take in fact only one argument, but return a function who takes the second argument, and so on. That&rsquo;s also called <i>partial function application</i>. So we can apply <code>remove_columns</code> to the argument <code>template</code> and map the resulting partial function onto each element of the <code>table_assoc</code><br>
</p>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 25: </span>Mapping a partial function onto a list of association lists</label><pre class="src src-ocaml">let table_cleaned = List.map (remove_columns template) table_assoc
</pre>
</div>
</div>
</div>
</div>
