blog/learning-to-code-first-ocaml-project-episode-2.tutorial.org
* Save the cleaned CSV to Disk

How do we get from our data structure, the association list …

#+caption: Result – not part of the program code
#+begin_src ocaml
  val table_cleaned : (string * string) list list =
                      [[("b", "2"); ("d", "4")];
                       [("b", "6"); ("d", "8")];
                       [("b", "10"); ("d", "12")]]
#+end_src

… to a CSV file =csvcleaner/output.csv= like this?

#+caption: How the cleaned CSV file should look like (not part of the program code)
#+begin_example
"b"|"d"
"2"|"4"
"6"|"8"
"10"|"12"
#+end_example

Let's check if there is a function in the Csv library that can take the association list ~table_cleaned~ and transform it into the CSV file. Here are the [[https://math.umons.ac.be/anum/software/csv/Csv/index.html][online docs for the Csv module]], by the way. But nope … nothing. Maybe a bit too far off.

Ok, then let's see if there is at least a function that will accept a /list of lists/ where each list represents a row? Like we had before where we used ~Csv.input_all~ to construct a list of lists from the ~input_channel~?

But there is no such one – oh wait! Now I realize that the type ~Csv.t~ is just a /type synonyme/ for ~string list list~, and there is in fact a function ~Csv.save~ that accepts an argument of the type ~Csv.t~.

That means, we have to transform the /association list/ ~table_cleaned~ into that kind of simpler list. So we go from this …

#+caption: Result – not part of the program code
#+begin_src ocaml
  val table_cleaned : (string * string) list list =
                      [[("b", "2"); ("d", "4")];
                       [("b", "6"); ("d", "8")];
                       [("b", "10"); ("d", "12")]]
#+end_src

… to that:

#+caption: Result – not part of the program code
#+begin_src ocaml
  - : string list list =
  [["b"; "d"];
   ["2"; "4"];
   ["6"; "8"];
   ["10"; "12"]]
#+end_src

We're going to pluck apart the association list ~table_cleaned~ and recombine its parts differently. Here's the plan:

1. We need all column headers to construct the first row of the CSV: so let's extract the /keys/ from the association list and put them in a list.
2. Extract the /values/ for each row and construct one list per row from them.
3. Put all those lists (rows) into another list.

I find it quite helpful to *start with small functions* who work on the *innermost structures* of the overall data structure. So let's write two little helpers:

The 1st helper function ~get_keys~ will extract all the keys from one row and collect those keys in a list. It will accept one argument of the type ~(string * string) list~.

The 2nd helper function ~get_values~ will extract the values from a row and collect them in a list. It will accept also one argument of the type ~(string * string) list~.

You may notice there's no formal parameter for the argument we pass to those functions. Why not? We could, but we'll use a short form here. It's only for Functions who accept only one argument /and/ employ pattern matching at the same time.

#+begin_src ocaml
  let rec get_keys =
    function
    | [] -> []
    | (k, _) :: tl -> k :: get_keys tl

  let rec get_values =
    function
    | [] -> []
    | (_, v) :: tl -> v :: get_values tl
#+end_src

Both functions are "list eaters", so they munch the elements of a list one after the other ~[("b", "2"); ("d", "4")]~. Therefore the functions will be /recursive/ – they call themself again and again until they have eaten all the rest elements, and there's nothing left but the empty list. Then they will stop.

That's why we define the empty list ~[]~ via pattern matching in the first branch as the /base case/. ~[] -> []~ means simply "If the argument matches the pattern /empty list/ -> return an /empty list/ (and don't do anything further)".

In the 2nd branch of the 1st function ~get_keys~ happens quite a lot: On the left side of the arrow we write down the pattern ~(k, _) :: tl~. It reads as follows: "From the list of tuples assign the variable ~k~ to the 1st element of the first tuple, ignore further elements of the first tuple if there are any. Assign the variable ~tl~ to refer to the rest of the list".

And the right side says: "Put the value bound to ~k~ in front of a list and repeat the whole process until nothing is left but an empty list". Mh, that's probably not 100 % exact, but you get the idea.

The 2nd function ~get_values~ is basically the same, except it cares about the second element of the tuple and assigns the variable ~v~ to its value.

One more detail: We have to mark functions with the /rec/ keyword to allow them to call themselfes recursively.

Now we're putting our helper functions to work as parts of a new function. Let's call that one ~dissoc~. Same here: it takes only one argument and does nothing else than pattern matching on that argument, so we can write it in short form too:

#+begin_src ocaml
  let dissoc =
    function
    | [] -> []
    | hd :: tl -> get_keys hd :: List.map get_values (hd :: tl)
#+end_src

Here's its type signature. What does it tell?
#+begin_src ocaml
  val dissoc : ('a * 'a) list list -> 'a list list = <fun>
#+end_src

Alternatively, we could write that function without pattern matching as well:

#+caption: Alternative – not part of the program code
#+begin_src ocaml
  let dissoc' lst =
    if lst == [] then []
    else get_keys (List.hd lst) :: List.map get_values lst
#+end_src

Now we can transform the association list into the type expected by the function ~Csv.save~, and we bind the result to the variable ~table_final~:

#+begin_src ocaml
  let table_final = dissoc table_cleaned
#+end_src

Finally, we can apply the function ~Csv.save~ from the Csv module. The function accepts a few other arguments for convenience (the ones that start with ~~~ are /labeled arguments/):

#+begin_src ocaml
  let () = Csv.save ~separator:'|' ~quote_all:true "output.csv" table_final
#+end_src

When we apply that function, suddenly a new CSV file =csvcleaner/output.csv= appears in the project directory!

#+caption: File content – csvcleaner/output.csv
#+begin_example
"b"|"d"
"2"|"4"
"6"|"8"
"10"|"12"
#+end_example

