blog/learning-to-code-first-ocaml-project-episode-2.tutorial.html
<div id="outline-container-org52a265e" class="outline-2">
<h2 id="org52a265e"><a href="#org52a265e">Save the cleaned CSV to Disk</a></h2>
<div class="outline-text-2" id="text-org52a265e">
<p>
How do we get from our data structure, the association list …<br>
</p>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 26: </span>Result – not part of the program code</label><pre class="src src-ocaml">val table_cleaned : (string * string) list list =
                    [[("b", "2"); ("d", "4")];
                     [("b", "6"); ("d", "8")];
                     [("b", "10"); ("d", "12")]]
</pre>
</div>

<p>
… to a CSV file <code>csvcleaner/output.csv</code> like this?<br>
</p>

<pre class="example" id="orgca025b4">
"b"|"d"
"2"|"4"
"6"|"8"
"10"|"12"
</pre>

<p>
Let&rsquo;s check if there is a function in the Csv library that can take the association list <code>table_cleaned</code> and transform it into the CSV file. Here are the <a href="https://math.umons.ac.be/anum/software/csv/Csv/index.html">online docs for the Csv module</a>, by the way. But nope … nothing. Maybe a bit too far off.<br>
</p>

<p>
Ok, then let&rsquo;s see if there is at least a function that will accept a <i>list of lists</i> where each list represents a row? Like we had before where we used <code>Csv.input_all</code> to construct a list of lists from the <code>input_channel</code>?<br>
</p>

<p>
But there is no such one – oh wait! Now I realize that the type <code>Csv.t</code> is just a <i>type synonyme</i> for <code>string list list</code>, and there is in fact a function <code>Csv.save</code> that accepts an argument of the type <code>Csv.t</code>.<br>
</p>

<p>
That means, we have to transform the <i>association list</i> <code>table_cleaned</code> into that kind of simpler list. So we go from this …<br>
</p>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 27: </span>Result – not part of the program code</label><pre class="src src-ocaml">val table_cleaned : (string * string) list list =
                    [[("b", "2"); ("d", "4")];
                     [("b", "6"); ("d", "8")];
                     [("b", "10"); ("d", "12")]]
</pre>
</div>

<p>
… to that:<br>
</p>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 28: </span>Result – not part of the program code</label><pre class="src src-ocaml">- : string list list =
[["b"; "d"];
 ["2"; "4"];
 ["6"; "8"];
 ["10"; "12"]]
</pre>
</div>

<p>
We&rsquo;re going to pluck apart the association list <code>table_cleaned</code> and recombine its parts differently. Here&rsquo;s the plan:<br>
</p>

<ol class="org-ol">
<li>We need all column headers to construct the first row of the CSV: so let&rsquo;s extract the <i>keys</i> from the association list and put them in a list.<br></li>
<li>Extract the <i>values</i> for each row and construct one list per row from them.<br></li>
<li>Put all those lists (rows) into another list.<br></li>
</ol>

<p>
I find it quite helpful to <b>start with small functions</b> who work on the <b>innermost structures</b> of the overall data structure. So let&rsquo;s write two little helpers:<br>
</p>

<p>
The 1st helper function <code>get_keys</code> will extract all the keys from one row and collect those keys in a list. It will accept one argument of the type <code>(string * string) list</code>.<br>
</p>

<p>
The 2nd helper function <code>get_values</code> will extract the values from a row and collect them in a list. It will accept also one argument of the type <code>(string * string) list</code>.<br>
</p>

<p>
You may notice there&rsquo;s no formal parameter for the argument we pass to those functions. Why not? We could, but we&rsquo;ll use a short form here. It&rsquo;s only for Functions who accept only one argument <i>and</i> employ pattern matching at the same time.<br>
</p>

<div class="org-src-container">
<pre class="src src-ocaml">let rec get_keys =
  function
  | [] -&gt; []
  | (k, _) :: tl -&gt; k :: get_keys tl

let rec get_values =
  function
  | [] -&gt; []
  | (_, v) :: tl -&gt; v :: get_values tl
</pre>
</div>

<p>
Both functions are &ldquo;list eaters&rdquo;, so they munch the elements of a list one after the other <code>[("b", "2"); ("d", "4")]</code>. Therefore the functions will be <i>recursive</i> – they call themself again and again until they have eaten all the rest elements, and there&rsquo;s nothing left but the empty list. Then they will stop.<br>
</p>

<p>
That&rsquo;s why we define the empty list <code>[]</code> via pattern matching in the first branch as the <i>base case</i>. <code>[] -&gt; []</code> means simply &ldquo;If the argument matches the pattern <i>empty list</i> -&gt; return an <i>empty list</i> (and don&rsquo;t do anything further)&rdquo;.<br>
</p>

<p>
In the 2nd branch of the 1st function <code>get_keys</code> happens quite a lot: On the left side of the arrow we write down the pattern <code>(k, _) :: tl</code>. It reads as follows: &ldquo;From the list of tuples assign the variable <code>k</code> to the 1st element of the first tuple, ignore further elements of the first tuple if there are any. Assign the variable <code>tl</code> to refer to the rest of the list&rdquo;.<br>
</p>

<p>
And the right side says: &ldquo;Put the value bound to <code>k</code> in front of a list and repeat the whole process until nothing is left but an empty list&rdquo;. Mh, that&rsquo;s probably not 100 % exact, but you get the idea.<br>
</p>

<p>
The 2nd function <code>get_values</code> is basically the same, except it cares about the second element of the tuple and assigns the variable <code>v</code> to its value.<br>
</p>

<p>
One more detail: We have to mark functions with the <i>rec</i> keyword to allow them to call themselfes recursively.<br>
</p>

<p>
Now we&rsquo;re putting our helper functions to work as parts of a new function. Let&rsquo;s call that one <code>dissoc</code>. Same here: it takes only one argument and does nothing else than pattern matching on that argument, so we can write it in short form too:<br>
</p>

<div class="org-src-container">
<pre class="src src-ocaml">let dissoc =
  function
  | [] -&gt; []
  | hd :: tl -&gt; get_keys hd :: List.map get_values (hd :: tl)
</pre>
</div>

<p>
Here&rsquo;s its type signature. What does it tell?<br>
</p>
<div class="org-src-container">
<pre class="src src-ocaml">val dissoc : ('a * 'a) list list -&gt; 'a list list = &lt;fun&gt;
</pre>
</div>

<p>
Alternatively, we could write that function without pattern matching as well:<br>
</p>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 29: </span>Alternative – not part of the program code</label><pre class="src src-ocaml">let dissoc' lst =
  if lst == [] then []
  else get_keys (List.hd lst) :: List.map get_values lst
</pre>
</div>

<p>
Now we can transform the association list into the type expected by the function <code>Csv.save</code>, and we bind the result to the variable <code>table_final</code>:<br>
</p>

<div class="org-src-container">
<pre class="src src-ocaml">let table_final = dissoc table_cleaned
</pre>
</div>

<p>
Finally, we can apply the function <code>Csv.save</code> from the Csv module. The function accepts a few other arguments for convenience (the ones that start with <code>~</code> are <i>labeled arguments</i>):<br>
</p>

<div class="org-src-container">
<pre class="src src-ocaml">let () = Csv.save ~separator:'|' ~quote_all:true "output.csv" table_final
</pre>
</div>

<p>
When we apply that function, suddenly a new CSV file <code>csvcleaner/output.csv</code> appears in the project directory!<br>
</p>

<pre class="example" id="org27abf34">
"b"|"d"
"2"|"4"
"6"|"8"
"10"|"12"
</pre>
</div>
</div>
