blog/learning-to-code-first-ocaml-project-episode-2.tutorial.org
* Conclusion

*Pattern matching is cool* because you have a visualization (the pattern) of the data structure you work on right before your eyes, and not just in your head.

*Type signatures* act like a brief unified description of what a function digests and what comes out at the end. That's quite elegant and helpful in most cases. It becomes unhelpful when a library author omits further explanations and examples.

*Finding sensible names* for functions and variables all the time sucks. More so, if type signatures and function definitions already say all there is to say. That means for me:
  - always consider whether a global definition is really necessary
  - keep small functions anonymous where possible
  - avoid formal parameters when they don't contribute to clarity

*Partial function application* (via curried functions) seems to be cool too. But to think in terms of chaining partial functions while reasoning about how to express a particular thing in code doesn't come naturally yet. Partial application can make code also more difficult to understand: Look at the following definition of the wrapper function ~save~. Is it clear that it actually takes another argument, namely the output file name?

#+caption: Example – not part of the program code
#+begin_src ocaml
  let save tab =
    Csv.save ~separator:'|' ~quote_all:true tab
#+end_src

One has to look at the type signature first to realize that the function can take one more argument, an innocent /string/ which is the file name:

#+caption: Type signature – not part of the program code
#+begin_src ocaml
  val save : string -> Csv.t -> unit = <fun>
#+end_src

That argument comes from the inner function ~Csv.save~ which takes the file name as a string:

#+caption: Type signature – not part of the program code
#+begin_src ocaml
  - : ?separator:char ->
      ?backslash_escape:bool ->
      ?excel_tricks:bool -> ?quote_all:bool -> string -> Csv.t -> unit
  = <fun>
#+end_src

** Full Code Listing

The separation of the program comes quite naturally: input - preparation - work - preparation - output. My code is not so elegant: Many many top-level definitions and variables who carry the intermediary results for the next steps.

Is there a better structure for this program? Maybe kinda like a pipe where you can plug in other functions in between – like layers of filters. That would make it easy to add new features in the future. I couldn't wait to refactor it that way, so I'm adding version 0.2 below. But first, here's the whole spaghetti pot we cooked up so far:

*** Version 0.1

#+CAPTION: The Spaghetti Monster
#+begin_src ocaml
  (* Version 0.1 *)

  (* Transforms the file into a key-value data structure *)

  let csv_file = open_in "input.csv"
  let table = Csv.input_all (Csv.of_channel csv_file)
  let () = close_in csv_file

  let header, content =
    match table with
    | [] -> assert false
    | hd :: tl -> hd, tl

  let table_assoc = Csv.associate header content


  (* Drops the columns that are not specified by the template *)

  let template_file = open_in "template.csv"
  let template = Csv.Rows.header (Csv.of_channel ~has_header:true template_file)
  let () = close_in template_file

  let rec remove_columns tpl row =
    match row with
    | [] -> []
    | (k, v) :: tl when List.mem k tpl -> (k, v) :: remove_columns tpl tl
    | _ :: tl -> remove_columns tpl tl

  let table_cleaned = List.map (remove_columns template) table_assoc


  (* Transforms the key-value data structure into lists representing lines *)

  let rec get_keys =
    function
    | [] -> []
    | (k, _) :: tl -> k :: get_keys tl

  let rec get_values =
    function
    | [] -> []
    | (_, v) :: tl -> v :: get_values tl

  let dissoc =
    function
    | [] -> []
    | hd :: tl -> get_keys hd :: List.map get_values (hd :: tl)

  let table_final = dissoc table_cleaned


  (* Writes the cleaned CSV file to disk *)

  let () = Csv.save ~separator:'|' ~quote_all:true "output.csv" table_final
#+end_src

*** Version 0.2

And here comes the code after refactoring. The version 0.2 hasn't got any shorter and the single functions got a bit more complex, but overall it got clearer than version 0.1.

#+CAPTION: The Pipe
#+begin_src ocaml
  (* Version 0.2 *)

  (** Transforms the file into a key-value data structure *)
  let prep file =
    let tab_file = open_in file in
    tab_file
    |> Csv.of_channel
    |> Csv.input_all
    |> fun tab -> let head, body =
                    match tab with
                    | [] -> assert false
                    | hd :: tl -> hd, tl in
    let () = close_in tab_file in
    Csv.associate head body


  (** Drops the columns that are not specified by the template *)
  let clean tab =
    let tpl_file = open_in "template.csv" in
    let tpl = tpl_file
              |> Csv.of_channel ~has_header:true
              |> Csv.Rows.header in
    let () = close_in tpl_file in
    let rec remove_cols tpl row =
      match row with
      | [] -> []
      | (k, v) :: tl when List.mem k tpl -> (k, v) :: remove_cols tpl tl
      | _ :: tl -> remove_cols tpl tl in
    List.map (remove_cols tpl) tab


  (** Transforms the key-value data structure into lists representing lines *)
  let dissoc =
    let rec get_keys =
      function
      | [] -> []
      | (k, _) :: tl -> k :: get_keys tl in
    let rec get_values =
      function
      | [] -> []
      | (_, v) :: tl -> v :: get_values tl in
    function
    | [] -> []
    | hd :: tl -> get_keys hd :: List.map get_values (hd :: tl)


  (** Writes the cleaned CSV file to disk *)
  let save tab =
    Csv.save ~separator:'|' ~quote_all:true tab


  (** Puts all together in one pipe *)
  let () = "input.csv"
           |> prep
           |> clean
           |> dissoc
           |> save "output.csv"
#+end_src

* Compile the Standalone Binary Executable

- *Compile only:* Change into your project directory ~cd csvcleaner/~ and issue the command ~dune build~. Your compiled binary will be =csvcleaner/_build/default/csvcleaner.exe=. Don't get confused about the /.exe/ suffix — it's just a naming convention in dune, not a windows binary if you compile on Linux.

- *Compile and run* the executable: ~dune exec ./csvcleaner.exe~

If you are looking for a versatile tool to work on CSV files, check out /csvtool/. It is a command line utility written in OCaml by the creator of the Csv library I'm using here, and it is available via Opam ~opam install csvtool~ or as a package in Ubuntu: ~apt install csvtool~ and probably other Linux distros.

* What's next?

In the [[file:first-coding-project-ocaml-tail-recursion-episode-3.tutorial.org][next episode]] I'm probably going to rewrite this again in Common Lisp using pattern matching, add a feature to version 0.2, or do something else entirely. Please let me know if you enjoyed the walktrough. Thank you for reading!
