blog/learning-to-code-first-ocaml-project-episode-2.tutorial.html
<div id="outline-container-org5575760" class="outline-2">
<h2 id="org5575760"><a href="#org5575760">Conclusion</a></h2>
<div class="outline-text-2" id="text-org5575760">
<p>
<b>Pattern matching is cool</b> because you have a visualization (the pattern) of the data structure you work on right before your eyes, and not just in your head.<br>
</p>

<p>
<b>Type signatures</b> act like a brief unified description of what a function digests and what comes out at the end. That&rsquo;s quite elegant and helpful in most cases. It becomes unhelpful when a library author omits further explanations and examples.<br>
</p>

<p>
<b>Finding sensible names</b> for functions and variables all the time sucks. More so, if type signatures and function definitions already say all there is to say. That means for me:<br>
</p>
<ul class="org-ul">
<li>always consider whether a global definition is really necessary<br></li>
<li>keep small functions anonymous where possible<br></li>
<li>avoid formal parameters when they don&rsquo;t contribute to clarity<br></li>
</ul>

<p>
<b>Partial function application</b> (via curried functions) seems to be cool too. But to think in terms of chaining partial functions while reasoning about how to express a particular thing in code doesn&rsquo;t come naturally yet. Partial application can make code also more difficult to understand: Look at the following definition of the wrapper function <code>save</code>. Is it clear that it actually takes another argument, namely the output file name?<br>
</p>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 30: </span>Example – not part of the program code</label><pre class="src src-ocaml">let save tab =
  Csv.save ~separator:'|' ~quote_all:true tab
</pre>
</div>

<p>
One has to look at the type signature first to realize that the function can take one more argument, an innocent <i>string</i> which is the file name:<br>
</p>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 31: </span>Type signature – not part of the program code</label><pre class="src src-ocaml">val save : string -&gt; Csv.t -&gt; unit = &lt;fun&gt;
</pre>
</div>

<p>
That argument comes from the inner function <code>Csv.save</code> which takes the file name as a string:<br>
</p>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 32: </span>Type signature – not part of the program code</label><pre class="src src-ocaml">- : ?separator:char -&gt;
    ?backslash_escape:bool -&gt;
    ?excel_tricks:bool -&gt; ?quote_all:bool -&gt; string -&gt; Csv.t -&gt; unit
= &lt;fun&gt;
</pre>
</div>
</div>
<div id="outline-container-orgcb98e15" class="outline-3">
<h3 id="orgcb98e15"><a href="#orgcb98e15">Full Code Listing</a></h3>
<div class="outline-text-3" id="text-orgcb98e15">
<p>
The separation of the program comes quite naturally: input - preparation - work - preparation - output. My code is not so elegant: Many many top-level definitions and variables who carry the intermediary results for the next steps.<br>
</p>

<p>
Is there a better structure for this program? Maybe kinda like a pipe where you can plug in other functions in between – like layers of filters. That would make it easy to add new features in the future. I couldn&rsquo;t wait to refactor it that way, so I&rsquo;m adding version 0.2 below. But first, here&rsquo;s the whole spaghetti pot we cooked up so far:<br>
</p>
</div>
<div id="outline-container-org61611bc" class="outline-4">
<h4 id="org61611bc"><a href="#org61611bc">Version 0.1</a></h4>
<div class="outline-text-4" id="text-org61611bc">
<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 33: </span>The Spaghetti Monster</label><pre class="src src-ocaml">(* Version 0.1 *)

(* Transforms the file into a key-value data structure *)

let csv_file = open_in "input.csv"
let table = Csv.input_all (Csv.of_channel csv_file)
let () = close_in csv_file

let header, content =
  match table with
  | [] -&gt; assert false
  | hd :: tl -&gt; hd, tl

let table_assoc = Csv.associate header content


(* Drops the columns that are not specified by the template *)

let template_file = open_in "template.csv"
let template = Csv.Rows.header (Csv.of_channel ~has_header:true template_file)
let () = close_in template_file

let rec remove_columns tpl row =
  match row with
  | [] -&gt; []
  | (k, v) :: tl when List.mem k tpl -&gt; (k, v) :: remove_columns tpl tl
  | _ :: tl -&gt; remove_columns tpl tl

let table_cleaned = List.map (remove_columns template) table_assoc


(* Transforms the key-value data structure into lists representing lines *)

let rec get_keys =
  function
  | [] -&gt; []
  | (k, _) :: tl -&gt; k :: get_keys tl

let rec get_values =
  function
  | [] -&gt; []
  | (_, v) :: tl -&gt; v :: get_values tl

let dissoc =
  function
  | [] -&gt; []
  | hd :: tl -&gt; get_keys hd :: List.map get_values (hd :: tl)

let table_final = dissoc table_cleaned


(* Writes the cleaned CSV file to disk *)

let () = Csv.save ~separator:'|' ~quote_all:true "output.csv" table_final
</pre>
</div>
</div>
</div>
<div id="outline-container-orgcef6da3" class="outline-4">
<h4 id="orgcef6da3"><a href="#orgcef6da3">Version 0.2</a></h4>
<div class="outline-text-4" id="text-orgcef6da3">
<p>
And here comes the code after refactoring. The version 0.2 hasn&rsquo;t got any shorter and the single functions got a bit more complex, but overall it got clearer than version 0.1.<br>
</p>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 34: </span>The Pipe</label><pre class="src src-ocaml">(* Version 0.2 *)

(** Transforms the file into a key-value data structure *)
let prep file =
  let tab_file = open_in file in
  tab_file
  |&gt; Csv.of_channel
  |&gt; Csv.input_all
  |&gt; fun tab -&gt; let head, body =
                  match tab with
                  | [] -&gt; assert false
                  | hd :: tl -&gt; hd, tl in
  let () = close_in tab_file in
  Csv.associate head body


(** Drops the columns that are not specified by the template *)
let clean tab =
  let tpl_file = open_in "template.csv" in
  let tpl = tpl_file
            |&gt; Csv.of_channel ~has_header:true
            |&gt; Csv.Rows.header in
  let () = close_in tpl_file in
  let rec remove_cols tpl row =
    match row with
    | [] -&gt; []
    | (k, v) :: tl when List.mem k tpl -&gt; (k, v) :: remove_cols tpl tl
    | _ :: tl -&gt; remove_cols tpl tl in
  List.map (remove_cols tpl) tab


(** Transforms the key-value data structure into lists representing lines *)
let dissoc =
  let rec get_keys =
    function
    | [] -&gt; []
    | (k, _) :: tl -&gt; k :: get_keys tl in
  let rec get_values =
    function
    | [] -&gt; []
    | (_, v) :: tl -&gt; v :: get_values tl in
  function
  | [] -&gt; []
  | hd :: tl -&gt; get_keys hd :: List.map get_values (hd :: tl)


(** Writes the cleaned CSV file to disk *)
let save tab =
  Csv.save ~separator:'|' ~quote_all:true tab


(** Puts all together in one pipe *)
let () = "input.csv"
         |&gt; prep
         |&gt; clean
         |&gt; dissoc
         |&gt; save "output.csv"
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="outline-container-org1cc37a7" class="outline-2">
<h2 id="org1cc37a7"><a href="#org1cc37a7">Compile the Standalone Binary Executable</a></h2>
<div class="outline-text-2" id="text-org1cc37a7">
<ul class="org-ul">
<li><b>Compile only:</b> Change into your project directory <code>cd csvcleaner/</code> and issue the command <code>dune build</code>. Your compiled binary will be <code>csvcleaner/_build/default/csvcleaner.exe</code>. Don&rsquo;t get confused about the <i>.exe</i> suffix — it&rsquo;s just a naming convention in dune, not a windows binary if you compile on Linux.<br></li>

<li><b>Compile and run</b> the executable: <code>dune exec ./csvcleaner.exe</code><br></li>
</ul>

<p>
If you are looking for a versatile tool to work on CSV files, check out <i>csvtool</i>. It is a command line utility written in OCaml by the creator of the Csv library I&rsquo;m using here, and it is available via Opam <code>opam install csvtool</code> or as a package in Ubuntu: <code>apt install csvtool</code> and probably other Linux distros.<br>
</p>
</div>
</div>
<div id="outline-container-org0be8dff" class="outline-2">
<h2 id="org0be8dff"><a href="#org0be8dff">What&rsquo;s next?</a></h2>
<div class="outline-text-2" id="text-org0be8dff">
<p>
In the <a href="first-coding-project-ocaml-tail-recursion-episode-3.tutorial.html">next episode</a> I&rsquo;m probably going to rewrite this again in Common Lisp using pattern matching, add a feature to version 0.2, or do something else entirely. Please let me know if you enjoyed the walktrough. Thank you for reading!<br>
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<div class="footer">Published by <span class="author"><a href="/bio.html">Dan Dee</a></span></div>
<script defer src="/static/footer.js"></script>
</div>
</body>
</html>
